# Напишите программу, которая выводит на экран результат сложения двух чисел
a=int(input())
b=int(input())
c=a+b
print(c)

# Напишите программу, которая выводит строку:  "I love (hate?) Python"
a=(input())
print (a)